/**
 * NAVER 도서 서비스를 이용해 생성된 도서 정보입니다
 */

interface ReviewData {
  author: string;
  content: string;
}

interface BookData {
  title: string;
  subTitle: string;
  description: string;
  author: string;
  publisher: string;
  coverImgUrl: string;
  reviews: ReviewData[];
}
export const seedData: BookData[] = [
  {
    title: '한 입 크기로 잘라 먹는 리액트',
    subTitle: '자바스크립트 기초부터 애플리케이션 배포까지',
    description:
      '자바스크립트 기초부터 애플리케이션 배포까지\n처음 시작하기 딱 좋은 리액트 입문서\n\n이 책은 웹 개발에서 가장 많이 사용하는 프레임워크인 리액트 사용 방법을 소개합니다. 인프런, 유데미에서 5000여 명이 수강한 베스트 강좌를 책으로 엮었습니다. 프런트엔드 개발을 희망하는 사람들을 위해 리액트의 기본을 익히고 다양한 앱을 구현하는 데 부족함이 없도록 만들었습니다. \n\n자바스크립트 기초 지식이 부족해 리액트 공부를 망설이는 분, 프런트엔드 개발을 희망하는 취준생으로 리액트가 처음인 분, 퍼블리셔나 백엔드에서 프런트엔드로 직군 전환을 꾀하거나 업무상 리액트가 필요한 분, 뷰, 스벨트 등 다른 프레임워크를 쓰고 있는데, 실용적인 리액트를 배우고 싶은 분, 신입 개발자이지만 자바스크립트나 리액트 기초가 부족한 분에게 유용할 것입니다.',
    author: '이정환',
    publisher: '프로그래밍인사이트',
    coverImgUrl:
      'https://shopping-phinf.pstatic.net/main_3888828/38888282618.20230913071643.jpg',
    reviews: [
      {
        author: '김진수',
        content:
          '한 입 크기로 잘라 먹는 리액트는 초보자부터 전문가까지 모두에게 도움이 되는 훌륭한 교재입니다. 리액트의 핵심 개념과 실무에서 바로 적용할 수 있는 팁을 제공합니다.',
      },
      {
        author: '박영호',
        content:
          '이 책은 리액트를 처음 접하는 개발자들에게도 적합하며, 단계별로 따라 할 수 있는 예제들이 풍부하게 수록되어 있습니다.',
      },
      {
        author: '최미나',
        content:
          '리액트의 고급 기능까지 다루고 있어 초보자뿐만 아니라 중급 이상의 개발자들도 깊이 있는 학습을 할 수 있습니다.',
      },
      {
        author: '코딩천재',
        content:
          '리액트의 핵심 개념을 파악하는 데 이 책만큼 좋은 교재는 없을 것입니다.',
      },
      {
        author: '개발하는민수',
        content: '실전 예제를 통해 개발 능력을 향상시키는 데에도 유용합니다.',
      },
      {
        author: '윤석진',
        content: '다양한 프로젝트에 활용할 수 있는 유용한 팁을 제공합니다.',
      },
      {
        author: '프론트마스터',
        content: '프로젝트에 바로 적용할 수 있는 팁이 많아 좋습니다.',
      },
      {
        author: '이수민',
        content: '리액트의 구조를 이해하고 싶다면 이 책을 추천합니다.',
      },
      {
        author: '박현주',
        content: '리액트 개발의 기본 개념을 쉽게 익히고 싶다면 추천합니다.',
      },
    ],
  },
  {
    title: '러닝스쿨! 자바스크립트 첫걸음',
    subTitle: '처음 프로그래밍을 시작하는 입문자의 눈높이에 맞춘',
    description:
      '실무에 꼭 필요한 자바스크립트 필수 지식과 핵심 기술을 가장 쉽게 설명한 입문서!\n\n《러닝스쿨! 자바스크립트 첫걸음》은 자바스크립트의 기초부터 프런트엔드 개발의 최신 트렌드까지 웹 개발을 시작하려는 분들에게 필수적인 지식을 제공하는 책입니다. 현재 가장 인기 있는 기술인 React.js와 Next.js를 배우고 싶은 초보자부터, 이미 이 기술들을 다루고 있는 개발자 모두에게 적합합니다. \n\n실무에서 자주 사용되는 문법들을 위주로, 이해하기 쉬운 예제와 명확한 설명으로 기초적인 개념부터 심화 내용까지 단계별로 배울 수 있고, 이를 활용해 프로젝트를 개발하는 과정까지 다양한 예제와 친절한 설명으로 쉽게 이해할 수 있도록 도와주는 책입니다. 《러닝스쿨! 자바스크립트 첫걸음》을 통해 웹 개발에 첫걸음을 내딛어 보길 바랍니다.',
    author: '김효빈',
    publisher: '위키북스',
    coverImgUrl:
      'https://shopping-phinf.pstatic.net/main_4731061/47310617618.20240426090954.jpg',
    reviews: [
      {
        author: '이진아',
        content:
          '자바스크립트 첫걸음은 자바스크립트를 처음 시작하는 사람에게 꼭 필요한 책입니다. 문법부터 고급 개념까지 체계적으로 배울 수 있습니다.',
      },
      {
        author: '윤세진',
        content: '이 책은 초보자에게도 쉽게 이해할 수 있는 좋은 교재입니다.',
      },
      {
        author: '김수현',
        content:
          '기초부터 고급까지 다양하게 다루고 있어 여러 개발자에게 유용합니다.',
      },
      {
        author: '코딩스타',
        content: '코딩의 기본 원리를 쉽게 배울 수 있도록 잘 구성되어 있습니다.',
      },
      {
        author: '프로그래밍왕',
        content: '자바스크립트의 기본 개념을 쉽게 익힐 수 있어 추천합니다.',
      },
      {
        author: '손승희',
        content: '고급 기능까지도 친절하게 다루고 있어 실무에 도움이 됩니다.',
      },
      {
        author: '홍준호',
        content: '예제 코드가 풍부해 학습 과정에서 바로 응용해 볼 수 있습니다.',
      },
    ],
  },
  {
    title: '세상에서 가장 쉬운 코딩책',
    subTitle: '6개월 만에 비전공자에서 개발자가 된 위캔코딩의 기초 코딩 수업',
    coverImgUrl:
      'https://shopping-phinf.pstatic.net/main_3776194/37761944621.20230614072126.jpg',
    author: '위캔코딩',
    publisher: '길벗',
    description:
      '텀블벅 11,688% 펀딩 분야 1위, 와디즈 2,276% 펀딩 달성!\n진짜 6개월만 공부하면 개발자가 될 수 있다!\n비전공자도 단번에 이해하는 코딩 입문서\n\n우리는 디지털과는 떼려야 뗄 수 없는 일상을 살고 있다. 스마트폰으로 업무를 하고 키오스크로 메뉴를 주문하며 줌(ZOOM)으로 지구 반대편에서 열리는 콘퍼런스를 시청한다. 최근에는 챗GPT라는 대화형 AI가 출시되는 등 멀게만 느껴졌던 인공지능도 자연스럽게 일상에 들어오고 있다. 디지털 기술이 보편화되면 될수록 필요한 것이 기본 IT 지식이고, 그중에서도 실무적으로 많이 활용되는 것이 바로 코딩 능력이다.\n《세상에서 가장 쉬운 코딩책》은 코딩을 처음 배우는 사람을 위한 입문서다. 텀블벅 11,688%, 와디즈 2,276%의 펀딩 달성률을 기록하며 이미 코딩 전자책으로 입소문 난 책을 이번에 정식 출간한 것이다. 패션업계에 몸담고 있던 저자는 커리어점프를 위해 코딩을 공부하기로 마음먹었으나 시중에 나와 있는 코딩책이 어려워 좌절을 겪는다. 하지만 나름의 방법으로 코딩과 개발을 배워 IT회사에 입사했다. 이후 자신처럼 코딩에 어려움을 느끼는 사람을 위해 갖은 노하우와 쉬운 설명을 곁들여 이 책을 집필했다. 미래를 위해 개발자로 취직하려는 비전공자, 개발자와 일하기 위해 코딩을 알아야 하는 IT기업 종사자 등 이 책으로 코딩의 기초를 습득할 수 있을 것이다.',
    reviews: [
      {
        author: '박영준',
        content:
          '세상에서 가장 쉬운 코딩책은 코딩의 기본 개념을 파악하기에 좋습니다.',
      },
      {
        author: '김태현',
        content: '다양한 예제를 통해 코딩을 배우기 좋습니다.',
      },
      {
        author: '프로그래머김',
        content: '코딩의 핵심을 익히기에 훌륭한 교재입니다.',
      },
      {
        author: '코딩매니아',
        content: '단계별로 학습하여 코딩의 기본을 다지기에 좋습니다.',
      },
      {
        author: '김주연',
        content: '코딩을 처음 배우는 사람에게 적합한 입문서입니다.',
      },
    ],
  },
  {
    title: 'Node.js 교과서',
    subTitle: '기본기에 충실한 Node.js 18 입문서',
    coverImgUrl:
      'https://shopping-phinf.pstatic.net/main_3647026/36470265624.20230110165934.jpg',
    author: '조현영',
    publisher: '길벗',
    description:
      'Node.js 베스트셀러 1위! 개정 3판!\n한 권으로 끝내는, 노드 기본부터 실무까지 전 과정 총망라! \n다양한 서비스를 직접 만드는, 실무에 가장 가까운 강의!\n\n개정 3판을 맞아 노드와 npm 패키지 버전을 최신으로 업데이트하고, 컨트롤러와 서비스를 분리해 사용하는 방식으로 예제 구조를 변경하면서 9~13장까지 모든 코드를 수정하며 완성도를 높였다. ES2022에 맞춰 Map/Set과 널 병합, 옵셔널 체이닝을 예제 코드 전반에 사용하고 관련 문법을 설명했으며, 정식 지원되는 ECMAScript 모듈 사용법도 추가했다. 또한, 요즘 적극적으로 도입되는 추세에 맞춰 노드 프로젝트를 타입스크립트로 전환하는 방법도 추가했다.\n이 책은 프런트부터 서버, 데이터베이스, 배포까지 아우르는 광범위한 내용을 다룬다. 군더더기 없는 직관적인 설명으로 기본 개념을 확실히 이해하고, 노드의 기능과 생태계를 사용해보면서 실제로 동작하는 서버를 만들어보자. 웹 서버, 웹 API 서버, 노드 서비스 테스트, SNS 서비스, 실시간 GIF 채팅방, 경매 시스템, 커맨드라인 인터페이스까지 경험할 수 있으며, 예제와 코드는 최신 문법을 사용해 실무에 바로 참고하거나 적용할 수 있게 했다.',
    reviews: [
      {
        author: '이상훈',
        content:
          'Node.js 교과서는 Node.js의 핵심 개념을 파악하는 데 도움이 됩니다.',
      },
      {
        author: '프론트신동',
        content: '다양한 예제가 있어 실무 프로젝트에 적용하기 좋습니다.',
      },
      {
        author: '개발하는이',
        content: 'Node.js를 처음 시작하는 사람에게 적합한 교재입니다.',
      },
    ],
  },
  {
    title: '얄코의 Too Much 친절한 HTML+CSS+자바스크립트',
    subTitle: '진짜 초보자도 자신 있게 끝낼 수 있도록 제대로 파는',
    coverImgUrl:
      'https://shopping-phinf.pstatic.net/main_4539739/45397393629.20240123091818.jpg',
    author: '고현민',
    publisher: '리코멘드',
    description:
      "★ 진짜 초보자도 자신 있게 끝낼 수 있도록 투머치 설명러 얄코가 다 알려 주는 웹 개발 가이드 \n\n명쾌한 설명과 전달력 높은 강의로 입문자들의 찬사를 받고 있는 얄코(얄팍한코딩사전)의 「제대로 파는 HTML+CSS」와 「뉴비를 위한 자바스크립트」 온라인 강의를 한 권의 책으로 담아냈습니다. 코딩이 처음인 사람도 어렵지 않게 프로그래밍과 웹 개발에 접근할 수 있도록 최대한 친절하고 쉬운 비유로 설명합니다. 한두 줄로 끝날 수 있는 기능 설명을 수많은 경우의 수의 화면을 보여 주며 비교하는 얄코 특유의 투머치 친절한 설명은 초보자뿐만 아니라 현업에 있는 개발자들도 놓치고 넘어가던 개념까지 세세하게 짚어 줍니다. \n『얄코의 TOO MUCH 친절한 HTML+CSS+자바스크립트』는 웹 페이지 제작에 필요한 세 가지 기술을 서로 연계해서 공부하는 데 최적화된 상태로 구성되어 있습니다. 또한 개발물을 단지 시각적으로만 구현하는 것을 넘어 다양한 사람을 배려하고 타 개발자와도 협업하기 좋은 '착한' 웹사이트를 만드는 법까지 놓치지 않습니다. 총 15시간에 이르는 동영상 강의와 함께 하면서 바쁜 독자들이 쉽고 편리하게 코딩의 즐거움을 느끼게 하는 것이 이 책의 최우선 목표입니다. \n\n‘얄코의 TOO MUCH 친절한’ 시리즈는\n친절하다고 하지만 세상 불친절한 것이 많아 ‘TOO MUCH 친절한’으로 탄생하였습니다.",
    reviews: [
      {
        author: '박나영',
        content:
          '얄코의 Too Much 친절한 HTML+CSS+자바스크립트는 실습 위주의 좋은 책입니다.',
      },
      {
        author: '프로그래밍마스터',
        content: '초보자도 쉽게 따라할 수 있는 좋은 예제가 많습니다.',
      },
      {
        author: '송유진',
        content: '기본 개념부터 차근차근 학습할 수 있습니다.',
      },
      {
        author: '개발의신',
        content: '웹 개발을 시작하는 사람에게 훌륭한 입문서입니다.',
      },
      {
        author: '김서현',
        content: '실제 프로젝트에 적용할 수 있는 다양한 정보가 많습니다.',
      },
    ],
  },
  {
    title: '프론트엔드 성능 최적화 가이드',
    subTitle: '웹 개발 스킬을 한 단계 높여 주는',
    coverImgUrl:
      'https://shopping-phinf.pstatic.net/main_3562758/35627588630.20230704084326.jpg',
    author: '유동균',
    publisher: '인사이트',
    description:
      "수강생 2천 명이 선택한 인프런 인기 강의\n다년간의 컨설팅과 강의 노하우를 담았다!\n4가지 실전 서비스로 배우는 웹 성능 최적화 기법\n\n'웹 성능 최적화'는 프론트엔드 개발자라면 반드시 고민해야 하는 이슈다. 서비스 환경과 상황에 따라 필요한 최적화 포인트가 다르고, 기법도 매우 다양하기에 개발 중인 서비스 특성에 맞게 커스터마이징하는 능력이 중요하다. \n저자는 수많은 기업의 웹 서비스 성능을 컨설팅하고, 삼성 SSAFY, 프로그래머스, 인프런, 스터디파이 등 강의 플랫폼에서 최적화 및 개발 강의를 진행한 경험을 책에 고스란히 녹여 냈다. '성능 최적화' 주제를 효과적으로 배우는 데 이론보다는 실습이 중요함을 강조하며 현장감 있게 구성했다. \n이 책은 실생활에서 흔히 개발하는 4가지 실습 사이트를 예제로, 직관적인 최적화 노하우를 전달한다. 콘텐츠 사이즈 최적화, 컴포넌트 지연 로딩과 사전 로딩, 병목 코드 최적화, 캐시 최적화 등 다각적인 포인트를 익혀 나만의 최적화 경험치를 쌓아 보자.",
    reviews: [
      {
        author: '박채은',
        content:
          '프론트엔드 성능 최적화 가이드는 실제 프로젝트에서 적용할 수 있는 팁이 많아 유용합니다.',
      },
      {
        author: '프론트엔드마스터',
        content: '성능 최적화에 대해 잘 정리된 훌륭한 책입니다.',
      },
      {
        author: '프론트마법사',
        content:
          '다양한 상황에서의 성능 최적화 전략이 자세히 설명되어 있습니다.',
      },
    ],
  },
  {
    title: '이펙티브 타입스크립트',
    subTitle: '동작 원리의 이해와 구체적인 조언 62가지',
    coverImgUrl:
      'https://shopping-phinf.pstatic.net/main_3247334/32473346832.20221227204218.jpg',
    author: '댄 밴더캄',
    publisher: '인사이트',
    description:
      '타입스크립트는 타입 정보를 지닌 자바스크립트의 상위 집합으로, 자바스크립트의 골치 아픈 문제점들을 해결해 준다. 이 책은 《이펙티브 C++》와 《이펙티브 자바》의 형식을 차용해 타입스크립트의 동작 원리, 해야 할 것과 하지 말아야 할 것에 대한 구체적인 조언을 62가지 항목으로 나누어 담았다.\n각 항목의 조언을 실제로 적용한 예제를 통해 연습하다 보면 타입스크립트를 효율적으로 사용하는 방법을 익힐 수 있다. 타입스크립트를 기초적인 수준에서만 활용했다면 이 책을 통해 타입스크립트 전문가로 거듭나 보자.\n\n이 책에서 다루는 내용\nㆍ 타입스크립트의 타입 시스템에 대한 자세한 이해\nㆍ 안전하고 명료한 코드를 작성할 수 있는 타입 설계\nㆍ 최소한의 타입 구문으로 완전한 안전성을 얻을 수 있는 타입 추론\nㆍ any 타입의 전략적 사용\nㆍ 의존성과 타입 선언 파일이 동작하는 원리\nㆍ 자바스크립트를 타입스크립트로 마이그레이션하는 방법',
    reviews: [
      {
        author: '이정민',
        content:
          '이펙티브 타입스크립트는 타입스크립트의 고급 기능을 쉽게 익히기에 좋은 책입니다.',
      },
      {
        author: '프로그래밍매니아',
        content:
          '타입스크립트의 핵심 개념을 실무 프로젝트에서 활용할 수 있습니다.',
      },
      {
        author: '개발천재',
        content: '다양한 팁을 활용해 프로젝트의 생산성을 높일 수 있습니다.',
      },
      {
        author: '김민수',
        content: '실무 예제와 함께 다양한 정보가 있어 추천합니다.',
      },
    ],
  },
  {
    title: 'NestJS로 배우는 백엔드 프로그래밍',
    subTitle: '타입스크립트 환경의 차세대 서버 프레임워크를 만나다',
    coverImgUrl:
      'https://shopping-phinf.pstatic.net/main_3625009/36250090622.20230928092017.jpg',
    author: '한용재',
    publisher: '제이펍',
    description:
      '가장 진보한 프레임워크로 우아하게 백엔드 입문하기\n\nNestJS는 Express를 기반으로 DB, ORM, 유효성 검사 등의 라이브러리를 내장한 차세대 백엔드 프레임워크다. 제어 반전, 의존성 주입, AOP 등 객체 지향 개념을 도입했고 타입스크립트로 모듈/컴포넌트 기반의 프로그래밍을 할 수 있다. 이 책은 저자가 모두싸인에 몸담으며 익힌 노하우와 인사이트를 바탕으로 NestJS를 활용해 회원 가입, 이메일 인증, 로그인, 회원 정보 조회 기능을 갖춘 REST API 유저 서비스를 만들어본다. 프로젝트에 점차 살을 붙여나가며 백엔드 개발에 필요한 환경 변수 설정, 요청 유효성 검사, 인증(JWT), 로깅, 헬스 체크, CQRS, 클린 아키텍처, 단위 테스트 등 지식과 기술을 제대로 익힐 수 있게 집필했다.',
    reviews: [
      {
        author: '박재현',
        content:
          'NestJS로 배우는 백엔드 프로그래밍은 백엔드 개발자에게 필요한 핵심 개념을 잘 설명해줍니다.',
      },
      {
        author: '박나현',
        content: '백엔드 프로그래밍의 개념을 이해하기에 좋은 책입니다.',
      },
      {
        author: '프론트고수',
        content: '백엔드 개발을 처음 시작하는 사람에게도 좋은 교재입니다.',
      },
      {
        author: '백엔드초보',
        content: '프로젝트에서 백엔드 개발의 노하우를 쌓는 데 유용합니다.',
      },
    ],
  },
  {
    title: '스프링 부트와 AWS로 혼자 구현하는 웹 서비스',
    subTitle:
      '인텔리제이, JPA, JUnit 테스트, 그레이들, 소셜 로그인, AWS 인프라로 무중단 배포까지',
    coverImgUrl:
      'https://shopping-phinf.pstatic.net/main_3243625/32436253723.20230928091945.jpg',
    author: '이동욱(향로)',
    publisher: '프리렉',
    description:
      '가장 빠르고 쉽게 웹 서비스의 모든 과정을 경험한다. \n경험이 실력이 되는 순간!\n\n이 책은 제목 그대로 스프링 부트와 AWS로 웹 서비스를 구현합니다. JPA와 JUnit 테스트, 그레이들, 머스테치, 스프링 시큐리티를 활용한 소셜 로그인 등으로 애플리케이션을 개발하고, 뒤이어 AWS 인프라의 기본 사용법과 AWS EC2와 RDS를 사용해 서비스가 가능하도록 합니다. 이렇게 점진적으로 스프링 부트 프로젝트를 개선해서 배포 자동화하고 무중단 배포까지 경험합니다. 실무 현장에서의 노하우와 테스트 방법, 객체지향 프로그래밍 등을 소개하고 다룹니다.\n \n스프링으로 하는 웹 개발이 이제는 어렵고 복잡하지 않습니다. 이 책은 기초 자바 지식만 있다면 편하게 진행할 수 있습니다. 스프링 부트 개념 설명에 집중하기 보단, 만드는 재미와 책을 보고 무엇을 만들 수 있을까에 집중했습니다. 국내 많은 서비스 회사들은 자바와 스프링을 사용하고 있습니다. 원하는 회사의 기술 스택과도 일치하고 구현하고 싶은 서비스도 쉽고 빠르게 만들고자 합니다. 전공 과제나 졸작, 취업 포트폴리오를 만들고 싶은 분들이나 실제 서비스 경험이 없는 주니어 개발자분들에게 도움이 될 것입니다.',
    reviews: [
      {
        author: '이서윤',
        content:
          '스프링 부트와 AWS로 혼자 구현하는 웹 서비스는 실무 적용을 위한 정보가 많습니다.',
      },
      {
        author: '코딩왕',
        content: '스프링 부트의 핵심 개념을 쉽게 배울 수 있는 좋은 책입니다.',
      },
      {
        author: '개발의고수',
        content: '다양한 상황에서 스프링 부트를 활용할 수 있는 팁이 많습니다.',
      },
      {
        author: '스프링마스터',
        content: '프로젝트에서 바로 활용할 수 있는 예제가 많아 좋습니다.',
      },
      {
        author: '김하나',
        content: '웹 서비스 구현에 유용한 내용이 많아 추천합니다.',
      },
    ],
  },
  {
    title: '토비의 스프링 3',
    subTitle: '스프링 프레임워크 3 기초 원리부터 고급 실전활용까지 완벽 가이드',
    coverImgUrl:
      'https://shopping-phinf.pstatic.net/main_3250387/32503877629.20220527022132.jpg',
    author: '이일민',
    publisher: '에이콘출판',
    description:
      '스프링 프레임워크 3 기초 원리부터 고급 실전활용까지 완벽 가이드\n\n『토비의 스프링 3』은 대한민국 전자정부 표준 프레임워크 기술로 선정된 스프링의 국내 최고 권위자 토비 이일민의 스프링 프레임워크 3 프로그래밍 바이블이다. 스프링의 3대 핵심 기술인 IoC/DI, PSA, AOP를 빠르고 효과적으로 배울 수 있는 실전 예제를 중심으로 설명하며, 자바 언어와 JDBC만 알면 누구라도 따라할 수 있는 52단계의 상세한 스프링 애플리케이션 핵심 코드 개발 과정을 담았다. 스프링 3.0의 최신 기술을 소개하며, 스프링 기술 선택을 위한 상세한 기술 비교, 선택 기준을 제시한다. 이 책은 스프링 애플리케이션 아키텍쳐 설계와 스프링 기반 프레임워크 제작을 위한 가이드북이다.',
    reviews: [
      {
        author: '최수빈',
        content:
          '토비의 스프링 3는 스프링 프레임워크의 핵심 개념을 파악하는 데 도움이 됩니다.',
      },
      {
        author: '이동욱',
        content: '스프링 프레임워크의 기초부터 고급 개념까지 모두 다룹니다.',
      },
      {
        author: '스프링마스터',
        content: '실무에서 활용할 수 있는 인사이트를 제공합니다.',
      },
    ],
  },
  {
    title: '자바 ORM 표준 JPA 프로그래밍',
    subTitle:
      '스프링 데이터 예제 프로젝트로 배우는 전자정부 표준 데이터베이스 프레임워크',
    coverImgUrl:
      'https://shopping-phinf.pstatic.net/main_3243600/32436007738.20221229072907.jpg',
    author: '김영한',
    publisher: '에이콘출판',
    description:
      '자바 ORM 표준 JPA는 SQL 작성 없이 객체를 데이터베이스에 직접 저장할 수 있게 도와주고, 객체와 관계형 데이터베이스의 차이도 중간에서 해결해준다. 이 책은 JPA 기초 이론과 핵심 원리, 그리고 실무에 필요한 성능 최적화 방법까지 JPA에 대한 모든 것을 다룬다. 또한, 스프링 프레임워크와 JPA를 함께 사용하는 방법을 설명하고, 스프링 데이터 JPA, QueryDSL 같은 혁신적인 오픈 소스를 활용해서 자바 웹 애플리케이션을 효과적으로 개발하는 방법을 다룬다.\n\n다음 링크에서 온라인 강의를 수강할 수 있다.\n\n■ 강의 링크: https://www.inflearn.com/roadmaps/149\n■ 온라인 강의 목록\n-자바 ORM 표준 JPA 프로그래밍 - 기본편: https://www.inflearn.com/course/ORM-JPA-Basic\n-실전! 스프링 부트와 JPA 활용1 - 웹 애플리케이션 개발: https://www.inflearn.com/course/스프링부트-JPA-활용-1\n-실전! 스프링 부트와 JPA 활용2 - API 개발과 성능 최적화: https://www.inflearn.com/course/스프링부트-JPA-API개발-성능최적화#\n-실전! 스프링 데이터 JPA: https://www.inflearn.com/course/스프링-데이터-JPA-실전\n-실전! Querydsl: https://www.inflearn.com/course/Querydsl-실전',
    reviews: [
      {
        author: '김서윤',
        content:
          '자바 ORM 표준 JPA 프로그래밍은 JPA의 기초부터 고급 기능까지 다룹니다.',
      },
      {
        author: '박영준',
        content:
          'JPA를 활용해 다양한 상황에서 데이터베이스를 효율적으로 관리할 수 있습니다.',
      },
      {
        author: 'JPA왕',
        content: 'JPA의 고급 기능까지도 쉽게 배울 수 있도록 구성되어 있습니다.',
      },
      {
        author: '개발신동',
        content: '실무 프로젝트에서 JPA를 적용하는 방법을 배울 수 있습니다.',
      },
    ],
  },
  {
    title: '오브젝트',
    subTitle: '코드로 이해하는 객체지향 설계',
    coverImgUrl:
      'https://shopping-phinf.pstatic.net/main_3245323/32453230352.20230627102640.jpg',
    author: '조영호',
    publisher: '위키북스',
    description:
      '역할, 책임, 협력을 향해 객체지향적으로 프로그래밍하라!\n\n객체지향으로 향하는 첫걸음은 클래스가 아니라 객체를 바라보는 것에서부터 시작한다. 객체지향으로 향하는 두번째 걸음은 객체를 독립적인 존재가 아니라 기능을 구현하기 위해 협력하는 공동체의 존재로 바라보는 것이다. 세번째 걸음을 내디딜 수 있는지 여부는 협력에 참여하는 객체 들에게 얼마나 적절한 역할과 책임을 부여할 수 있느냐에 달려 있다. 객체지향의 마지막 걸음은 앞에서 설명한 개념들을 여러분이 사용하는 프로그래밍 언어라는 틀에 흐트러짐 없이 담아낼 수 있는 기술을 익히는 것이다.\n\n《객체지향의 사실과 오해》가 첫번째 걸음과 두번째 걸음인 객체와 협력에 초점을 맞췄다면 《오브젝트: 코드로 이해하는 객체지향 설계》는 세번째와 네번째 걸음인 책임의 할당과 그 구현에 초점을 맞춘다. 이 책을 읽고 나면 객체에 적절한 역할과 책임을 부여하는 방법과 유연하면서도 요구사항에 적절한 협력을 설계하는 방법을 익히게 될 것이다. 나아가 프로그래밍 언어라는 도구를 이용해 객체지향의 개념과 원칙들을 오롯이 표현할 수 있는 방법 역시 익힐 수 있을 것이다.\n\n★ 이 책에서 다루는 내용 ★ \n\n◎ 역할, 책임, 협력에 기반해 객체지향 프로그램을 설계하고 구현하는 방법\n◎ 응집도와 결합도를 이용해 설계를 트레이드오프하는 방법\n◎ 설계를 유연하게 만드는 다양한 의존성 관리 기법\n◎ 타입 계층을 위한 상속과 코드 재사용을 위한 합성의 개념\n◎ 다양한 설계 원칙과 디자인 패턴',
    reviews: [
      {
        author: '박지은',
        content:
          '오브젝트는 객체 지향 프로그래밍의 기본 원리를 이해하는 데 도움이 됩니다.',
      },
      {
        author: '프로그래밍신동',
        content:
          '객체 지향 프로그래밍의 설계 원리를 배우는 데 훌륭한 가이드입니다.',
      },
      {
        author: '이현정',
        content:
          '다양한 예제와 함께 객체 지향 프로그래밍의 핵심을 배울 수 있습니다.',
      },
      {
        author: '객체마스터',
        content: '다양한 프로젝트에 바로 적용할 수 있는 좋은 정보가 많습니다.',
      },
    ],
  },
];
